---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.SetFillGrid(System.Int32,Autodesk.Revit.DB.FillGrid)
source: html/1f12079c-df50-838e-9693-5a1caf23de29.htm
---
# Autodesk.Revit.DB.FillPattern.SetFillGrid Method

Sets the fill grid.

## Syntax (C#)
```csharp
public void SetFillGrid(
	int gridIdx,
	FillGrid fillGrid
)
```

## Parameters
- **gridIdx** (`System.Int32`) - The index of the fill grid.
- **fillGrid** (`Autodesk.Revit.DB.FillGrid`) - The fill grid to be used.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null